UFTOneAutomationTests/APITestCreateOrder/Result1/Report/Data/Step2.xml

<?xml-stylesheet href="..//StServiceCallActivity.xsl" type="text/xsl"?><report><VTD_Type name="Type">HP.ST.Ext.WebServicesActivities.StServiceCallActivity</VTD_Type><VTD_Name name="Step ID">StServiceCallActivity4</VTD_Name><InputXml name="InputXml" xml="True" link="True" FileLocation="StServiceCallActivity4_InputXml_0c9687bc-80b9-47f9-bd28-0107d57565a4.xml">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;Body&gt;
    &lt;GetFlights xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
      &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
      &lt;FlightDate&gt;2115-02-28T00:00:00&lt;/FlightDate&gt;
    &lt;/GetFlights&gt;
  &lt;/Body&gt;
&lt;/Envelope&gt;</InputXml><Service name="Service">Flights_Service</Service><Port name="Port">FlightsServiceMethods</Port><Operation name="Operation">GetFlights</Operation><Address name="Address">http://localhost:8000/Flights_SOAP</Address><SOAPAction name="SOAPAction">HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights</SOAPAction><ContentType name="ContentType">text/xml; charset=utf-8</ContentType><MessageExchangePattern name="MessageExchangePattern">Request Response</MessageExchangePattern><Full_request name="Full request" TooLong="True" link="True" FileLocation="StServiceCallActivity4_Full_request_5425bb2a-24b6-4ecb-9629-3df170bc2227.xml">&lt;?xml version="1.0"? ... &lt;/Body&gt;
&lt;/Envelope&gt;</Full_request><InputHeader name="InputHeader">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights
Content-Type:	text/xml; charset=utf-8
Host:	localhost:8000
Content-Length:	261
Connection:	Close
</InputHeader><OutputHeader name="OutputHeader">Connection:	close
Content-Length:	4207
Content-Type:	text/xml; charset=utf-8
Date:	Sun, 03 Jul 2022 17:29:02 GMT
Server:	Microsoft-HTTPAPI/2.0
</OutputHeader><OutputText name="OutputText">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;&lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;Flight&gt;&lt;Airline&gt;DA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;08:53 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;08:09 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;1435&lt;/FlightNumber&gt;&lt;Price&gt;109.2&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;08:45 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3227&lt;/FlightNumber&gt;&lt;Price&gt;103.9&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;11:09 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;10:24 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3231&lt;/FlightNumber&gt;&lt;Price&gt;105.2&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;UA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;02:48 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3233&lt;/FlightNumber&gt;&lt;Price&gt;166.2&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;01:33 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3235&lt;/FlightNumber&gt;&lt;Price&gt;108.8&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;UA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;04:18 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3236&lt;/FlightNumber&gt;&lt;Price&gt;174.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DL&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;04:42 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3238&lt;/FlightNumber&gt;&lt;Price&gt;175.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;03:57 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3239&lt;/FlightNumber&gt;&lt;Price&gt;103.4&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;01:41 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:57 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3418&lt;/FlightNumber&gt;&lt;Price&gt;170.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;10:05 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;09:21 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3564&lt;/FlightNumber&gt;&lt;Price&gt;124.4&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;05:17 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;04:33 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;4941&lt;/FlightNumber&gt;&lt;Price&gt;177.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;07:41 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;06:57 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6065&lt;/FlightNumber&gt;&lt;Price&gt;122.8&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;12:29 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;11:45 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6087&lt;/FlightNumber&gt;&lt;Price&gt;111.2&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;11:00 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6226&lt;/FlightNumber&gt;&lt;Price&gt;173.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;04:05 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:21 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;7465&lt;/FlightNumber&gt;&lt;Price&gt;122.8&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;02:53 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;&lt;DepartureTime&gt;02:09 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;7854&lt;/FlightNumber&gt;&lt;Price&gt;125.2&lt;/Price&gt;&lt;/Flight&gt;&lt;/GetFlightsResult&gt;&lt;/GetFlightsResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</OutputText><HttpStatusCode name="HttpStatusCode">200 : OK</HttpStatusCode><OutputXml name="OutputXml" xml="True" link="True" FileLocation="StServiceCallActivity4_OutputXml_26529fb8-4790-4069-8bba-aff11019a9a1.xml">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s:Body&gt;
    &lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;DA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;08:53 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;08:09 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;1435&lt;/FlightNumber&gt;
          &lt;Price&gt;109.2&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;08:45 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;3227&lt;/FlightNumber&gt;
          &lt;Price&gt;103.9&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;11:09 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;10:24 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;3231&lt;/FlightNumber&gt;
          &lt;Price&gt;105.2&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;UA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;02:48 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;3233&lt;/FlightNumber&gt;
          &lt;Price&gt;166.2&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;01:33 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;3235&lt;/FlightNumber&gt;
          &lt;Price&gt;108.8&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;UA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;04:18 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;3236&lt;/FlightNumber&gt;
          &lt;Price&gt;174.47&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;DL&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;04:42 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;3238&lt;/FlightNumber&gt;
          &lt;Price&gt;175.47&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;03:57 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;3239&lt;/FlightNumber&gt;
          &lt;Price&gt;103.4&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;DA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;01:41 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;12:57 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;3418&lt;/FlightNumber&gt;
          &lt;Price&gt;170.47&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;DA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;10:05 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;09:21 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;3564&lt;/FlightNumber&gt;
          &lt;Price&gt;124.4&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;DA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;05:17 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;04:33 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;4941&lt;/FlightNumber&gt;
          &lt;Price&gt;177.47&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;DA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;07:41 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;06:57 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;6065&lt;/FlightNumber&gt;
          &lt;Price&gt;122.8&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;DA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;12:29 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;11:45 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;6087&lt;/FlightNumber&gt;
          &lt;Price&gt;111.2&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;11:00 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;6226&lt;/FlightNumber&gt;
          &lt;Price&gt;173.47&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;DA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;04:05 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;03:21 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;7465&lt;/FlightNumber&gt;
          &lt;Price&gt;122.8&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;DA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;02:53 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;San Francisco&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;02:09 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;7854&lt;/FlightNumber&gt;
          &lt;Price&gt;125.2&lt;/Price&gt;
        &lt;/Flight&gt;
      &lt;/GetFlightsResult&gt;
    &lt;/GetFlightsResponse&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</OutputXml><VTD_Message name="Message">Web service call performed successfully</VTD_Message><Name name="Name">'GetFlights'</Name><Comment name="Comment">''</Comment><VTD_Status name="Status">Done</VTD_Status></report>